Autodesk.Revit.Creation.Document.NewUnionFitting(Autodesk.Revit.DB.Connector,Autodesk.Revit.DB.Connector)
Add a new family instance of an union fitting into the Autodesk Revit document,
using two connectors.
connector1: The first connector to be connected to the union.
connector2: The second connector to be connected to the union.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
Thrown when the input argument connector1 or connector2 is null.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Thrown when the connectors cannot be used for union creation. For example,
they cannot be from the same element, they must be of the same domain and shape,
and the owner of the connector1 should be a (flex) duct or pipe.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Thrown when union fitting cannot be created.
Returns: If creation was successful then a family instance to the new union object is returned,
otherwise an exception with failure information will be thrown. In the case of successful creation
with another fitting type, null may be returned.